RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32L43x_Firmware_Library/n32l43x_std_periph_driver/inc/n32l43x_lcd.h
/*****************************************************************************
 * Copyright (c) 2022, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file n32l43x_lcd.h
 * @author Nations
 * @version v1.2.0
 *
 * @copyright Copyright (c) 2022, Nations Technologies Inc. All rights reserved.
 */

#ifndef __N32L43X_LCD_H__
#define __N32L43X_LCD_H__

#ifdef __cplusplus
 extern "C" {
#endif

#include "n32l43x.h"
/** @addtogroup N32L43x_StdPeriph_Driver
 * @{
 */

/** @addtogroup LCD
 * @{
 */

/* LCD Exported constants --------------------------------------------------------*/
/** @addtogroup LCD_Exported_Constants LCD Exported Constants
  * @{
  */

/**
 * @brief   LCD error code
 */
typedef enum {
    LCD_ERROR_OK        = 0x00,     /*!< No error */
    LCD_ERROR_FCRSF     = 0x01,     /*!< Synchro flag error */
    LCD_ERROR_UDR       = 0x02,     /*!< Update display request flag error */
    LCD_ERROR_UDD       = 0x03,     /*!< Update display done flag error */
    LCD_ERROR_ENSTS     = 0x04,     /*!< LCD enabled status flag error */
    LCD_ERROR_RDY       = 0x05,     /*!< LCD VLCD ready flag error */
    LCD_ERROR_PARAM     = 0x06,     /*!< LCD function parameter error */
    LCD_ERROR_CLK       = 0x07,     /*!< LCD clock source fail error */
}LCD_ErrorTypeDef;

/**
* @brief    LCD normal timeout
*/
#define LCD_TIME_OUT    (0x01000000)

/**
 * @defgroup   LCD_Clock_Source
 */
#define LCD_CLK_SRC_LSI                 (RCC_RTCCLK_SRC_LSI)                        /*!< LSI*/
#define LCD_CLK_SRC_LSE                 (RCC_LSE_ENABLE|RCC_RTCCLK_SRC_LSE)         /*!< LSE */
#define LCD_CLK_SRC_LSE_BYPASS          (RCC_LSE_BYPASS|RCC_RTCCLK_SRC_LSE)         /*!< LSE bypass */
#define LCD_CLK_SRC_HSE_DIV32           (RCC_HSE_ENABLE|RCC_RTCCLK_SRC_HSE_DIV32)   /*!< HSE */
#define LCD_CLK_SRC_HSE_BYPASS_DIV32    (RCC_HSE_BYPASS|RCC_RTCCLK_SRC_HSE_DIV32)   /*!< HSE bypass */

/**
  * @}
  */

/**
 * @defgroup   LCD_RAMRegister
 */
#define LCD_RAM1_COM0   (0x00000000U)
#define LCD_RAM2_COM0   (0x00000001U)
#define LCD_RAM1_COM1   (0x00000002U)
#define LCD_RAM2_COM1   (0x00000003U)
#define LCD_RAM1_COM2   (0x00000004U)
#define LCD_RAM2_COM2   (0x00000005U)
#define LCD_RAM1_COM3   (0x00000006U)
#define LCD_RAM2_COM3   (0x00000007U)
#define LCD_RAM1_COM4   (0x00000008U)
#define LCD_RAM2_COM4   (0x00000009U)
#define LCD_RAM1_COM5   (0x0000000AU)
#define LCD_RAM2_COM5   (0x0000000BU)
#define LCD_RAM1_COM6   (0x0000000CU)
#define LCD_RAM2_COM6   (0x0000000DU)
#define LCD_RAM1_COM7   (0x0000000EU)
#define LCD_RAM2_COM7   (0x0000000FU)
/**
  * @}
  */

/**
 * @defgroup   LCD_Prescaler
 */
#define LCD_PRESCALER_1         (0x00000000U)                   /*!< CLKPS = LCDCLK         */
#define LCD_PRESCALER_2         (0x1UL << LCD_FCTRL_PRES_Pos)   /*!< 0x00400000U  CLKPS = LCDCLK/2      */
#define LCD_PRESCALER_4         (0x2UL << LCD_FCTRL_PRES_Pos)   /*!< 0x00800000U  CLKPS = LCDCLK/4      */
#define LCD_PRESCALER_8         (0x3UL << LCD_FCTRL_PRES_Pos)   /*!< 0x00C00000U  CLKPS = LCDCLK/8      */
#define LCD_PRESCALER_16        (0x4UL << LCD_FCTRL_PRES_Pos)   /*!< 0x01000000U  CLKPS = LCDCLK/16     */
#define LCD_PRESCALER_32        (0x5UL << LCD_FCTRL_PRES_Pos)   /*!< 0x01400000U  CLKPS = LCDCLK/32     */
#define LCD_PRESCALER_64        (0x6UL << LCD_FCTRL_PRES_Pos)   /*!< 0x01800000U  CLKPS = LCDCLK/64     */
#define LCD_PRESCALER_128       (0x7UL << LCD_FCTRL_PRES_Pos)   /*!< 0x01C00000U  CLKPS = LCDCLK/128    */
#define LCD_PRESCALER_256       (0x8UL << LCD_FCTRL_PRES_Pos)   /*!< 0x02000000U  CLKPS = LCDCLK/256    */
#define LCD_PRESCALER_512       (0x9UL << LCD_FCTRL_PRES_Pos)   /*!< 0x02400000U  CLKPS = LCDCLK/512    */
#define LCD_PRESCALER_1024      (0xAUL << LCD_FCTRL_PRES_Pos)   /*!< 0x02800000U  CLKPS = LCDCLK/1024   */
#define LCD_PRESCALER_2048      (0xBUL << LCD_FCTRL_PRES_Pos)   /*!< 0x02C00000U  CLKPS = LCDCLK/2048   */
#define LCD_PRESCALER_4096      (0xCUL << LCD_FCTRL_PRES_Pos)   /*!< 0x03000000U  CLKPS = LCDCLK/4096   */
#define LCD_PRESCALER_8192      (0xDUL << LCD_FCTRL_PRES_Pos)   /*!< 0x03400000U  CLKPS = LCDCLK/8192   */
#define LCD_PRESCALER_16384     (0xEUL << LCD_FCTRL_PRES_Pos)   /*!< 0x03800000U  CLKPS = LCDCLK/16384  */
#define LCD_PRESCALER_32768     (0xFUL << LCD_FCTRL_PRES_Pos)   /*!< 0x03C00000U  CLKPS = LCDCLK/32768  */
/**
  * @}
  */

/**
 * @defgroup   LCD_Divider
 */
#define LCD_DIV_16      (0x00000000U)   /*!< CLKDIV = CLKPS/(16) */
#define LCD_DIV_17      (0x1UL << LCD_FCTRL_DIV_Pos)    /*!< 0x00040000U  CLKDIV = CLKPS/(17) */
#define LCD_DIV_18      (0x2UL << LCD_FCTRL_DIV_Pos)    /*!< 0x00080000U  CLKDIV = CLKPS/(18) */
#define LCD_DIV_19      (0x3UL << LCD_FCTRL_DIV_Pos)    /*!< 0x000C0000U  CLKDIV = CLKPS/(19) */
#define LCD_DIV_20      (0x4UL << LCD_FCTRL_DIV_Pos)    /*!< 0x00100000U  CLKDIV = CLKPS/(20) */
#define LCD_DIV_21      (0x5UL << LCD_FCTRL_DIV_Pos)    /*!< 0x00140000U  CLKDIV = CLKPS/(21) */
#define LCD_DIV_22      (0x6UL << LCD_FCTRL_DIV_Pos)    /*!< 0x00180000U  CLKDIV = CLKPS/(22) */
#define LCD_DIV_23      (0x7UL << LCD_FCTRL_DIV_Pos)    /*!< 0x001C0000U  CLKDIV = CLKPS/(23) */
#define LCD_DIV_24      (0x8UL << LCD_FCTRL_DIV_Pos)    /*!< 0x00200000U  CLKDIV = CLKPS/(24) */
#define LCD_DIV_25      (0x9UL << LCD_FCTRL_DIV_Pos)    /*!< 0x00240000U  CLKDIV = CLKPS/(25) */
#define LCD_DIV_26      (0xAUL << LCD_FCTRL_DIV_Pos)    /*!< 0x00280000U  CLKDIV = CLKPS/(26) */
#define LCD_DIV_27      (0xBUL << LCD_FCTRL_DIV_Pos)    /*!< 0x002C0000U  CLKDIV = CLKPS/(27) */
#define LCD_DIV_28      (0xCUL << LCD_FCTRL_DIV_Pos)    /*!< 0x00300000U  CLKDIV = CLKPS/(28) */
#define LCD_DIV_29      (0xDUL << LCD_FCTRL_DIV_Pos)    /*!< 0x00340000U  CLKDIV = CLKPS/(29) */
#define LCD_DIV_30      (0xEUL << LCD_FCTRL_DIV_Pos)    /*!< 0x00380000U  CLKDIV = CLKPS/(30) */
#define LCD_DIV_31      (0xFUL << LCD_FCTRL_DIV_Pos)    /*!< 0x003C0000U  CLKDIV = CLKPS/(31) */
/**
  * @}
  */

/**
 * @defgroup   LCD_Duty
 */
#define LCD_DUTY_STATIC (0x00000000U)                   /*!< Static duty */
#define LCD_DUTY_1_2    (0x1UL << LCD_CTRL_DUTY_Pos)    /*!< 0x00000004U  1/2 duty    */
#define LCD_DUTY_1_3    (0x2UL << LCD_CTRL_DUTY_Pos)    /*!< 0x00000004U  1/3 duty    */
#define LCD_DUTY_1_4    (0x3UL << LCD_CTRL_DUTY_Pos)    /*!< 0x00000004U  1/4 duty    */
#define LCD_DUTY_1_8    (0x4UL << LCD_CTRL_DUTY_Pos)    /*!< 0x00000004U  1/8 duty    */
/**
  * @}
  */

/**
 * @defgroup   LCD_Bias
 */
#define LCD_BIAS_1_2    (0x00000000U)                   /*!< 1/2 Bias */
#define LCD_BIAS_1_3    (0x1UL << LCD_CTRL_BIAS_Pos)    /*!< 0x00000020U  1/3 Bias */
#define LCD_BIAS_1_4    (0x2UL << LCD_CTRL_BIAS_Pos)    /*!< 0x00000040U  1/4 Bias */
/**
  * @}
  */

/**
 * @defgroup   LCD_Voltage_source
 */
#define LCD_VOLTAGESOURCE_INTERNAL  (0x00000000U)   /*!< Internal voltage source for the LCD  */
#define LCD_VOLTAGESOURCE_EXTERNAL  (LCD_CTRL_VSEL) /*!< External voltage source for the LCD   */
/**
  * @}
  */

/**
 * @defgroup   LCD_Contrast
 */
#define LCD_CONTRASTLEVEL_0     (0x00000000U)                       /*!< Maximum Voltage = 2.60V    */
#define LCD_CONTRASTLEVEL_1     (0x1UL << LCD_FCTRL_CONTRAST_Pos)   /*!< 0x00000400U  Maximum Voltage = 2.73V    */
#define LCD_CONTRASTLEVEL_2     (0x2UL << LCD_FCTRL_CONTRAST_Pos)   /*!< 0x00000800U  Maximum Voltage = 2.86V    */
#define LCD_CONTRASTLEVEL_3     (0x3UL << LCD_FCTRL_CONTRAST_Pos)   /*!< 0x00000C00U  Maximum Voltage = 2.99V    */
#define LCD_CONTRASTLEVEL_4     (0x4UL << LCD_FCTRL_CONTRAST_Pos)   /*!< 0x00001000U  Maximum Voltage = 3.12V    */
#define LCD_CONTRASTLEVEL_5     (0x5UL << LCD_FCTRL_CONTRAST_Pos)   /*!< 0x00001400U  Maximum Voltage = 3.26V    */
#define LCD_CONTRASTLEVEL_6     (0x6UL << LCD_FCTRL_CONTRAST_Pos)   /*!< 0x00001800U  Maximum Voltage = 3.40V    */
#define LCD_CONTRASTLEVEL_7     (0x7UL << LCD_FCTRL_CONTRAST_Pos)   /*!< 0x00001C00U  Maximum Voltage = 3.55V    */
/**
  * @}
  */

/**
 * @defgroup   LCD_DeadTime
 */
#define LCD_DEADTIME_0      (0x00000000U)                   /*!< No dead Time      */
#define LCD_DEADTIME_1      (0x1UL << LCD_FCTRL_DEAD_Pos)   /*!< 0x00000080U One Phase between different couple of Frame   */
#define LCD_DEADTIME_2      (0x2UL << LCD_FCTRL_DEAD_Pos)   /*!< 0x00000100U Two Phase between different couple of Frame   */
#define LCD_DEADTIME_3      (0x3UL << LCD_FCTRL_DEAD_Pos)   /*!< 0x00000180UThree Phase between different couple of Frame */
#define LCD_DEADTIME_4      (0x4UL << LCD_FCTRL_DEAD_Pos)   /*!< 0x00000200UFour Phase between different couple of Frame  */
#define LCD_DEADTIME_5      (0x5UL << LCD_FCTRL_DEAD_Pos)   /*!< 0x00000280UFive Phase between different couple of Frame  */
#define LCD_DEADTIME_6      (0x6UL << LCD_FCTRL_DEAD_Pos)   /*!< 0x00000300USix Phase between different couple of Frame   */
#define LCD_DEADTIME_7      (0x7UL << LCD_FCTRL_DEAD_Pos)   /*!< 0x00000380USeven Phase between different couple of Frame */
/**
  * @}
  */

/**
 * @defgroup   LCD_PulseOnDuration
 */
#define LCD_PULSEONDURATION_0   (0x00000000U)                   /*!<  Pulse ON duration = 0 pulse  */
#define LCD_PULSEONDURATION_1   (0x1U << LCD_FCTRL_PULSEON_Pos) /*!< 0x00000010U Pulse ON duration = 1/CK_PS  */
#define LCD_PULSEONDURATION_2   (0x2U << LCD_FCTRL_PULSEON_Pos) /*!< 0x00000020U Pulse ON duration = 2/CK_PS  */
#define LCD_PULSEONDURATION_3   (0x3U << LCD_FCTRL_PULSEON_Pos) /*!< 0x00000030U Pulse ON duration = 3/CK_PS  */
#define LCD_PULSEONDURATION_4   (0x4U << LCD_FCTRL_PULSEON_Pos) /*!< 0x00000040U Pulse ON duration = 4/CK_PS  */
#define LCD_PULSEONDURATION_5   (0x5U << LCD_FCTRL_PULSEON_Pos) /*!< 0x00000050U Pulse ON duration = 5/CK_PS  */
#define LCD_PULSEONDURATION_6   (0x6U << LCD_FCTRL_PULSEON_Pos) /*!< 0x00000060U Pulse ON duration = 6/CK_PS  */
#define LCD_PULSEONDURATION_7   (0x7U << LCD_FCTRL_PULSEON_Pos) /*!< 0x00000070U Pulse ON duration = 7/CK_PS  */
/**
  * @}
  */

/**
 * @defgroup   LCD_HighDrive
 */
#define LCD_HIGHDRIVE_DISABLE  (0x00000000U)       /*!< High drive disabled */
#define LCD_HIGHDRIVE_ENABLE   (LCD_FCTRL_HDEN)    /*!< High drive enabled  */
/**
  * @}
  */

/**
 * @defgroup   LCD_HighDrive_Buffer
 */
#define LCD_HIGHDRIVEBUFFER_DISABLE    (0x00000000U)       /*!< High drive buffer disabled */
#define LCD_HIGHDRIVEBUFFER_ENABLE     (LCD_CTRL_BUFEN)    /*!< High drive buffer enabled  */
/**
  * @}
  */

/**
 * @defgroup   LCD_Blink_Mode
 */
#define LCD_BLINKMODE_OFF           (0x00000000U)                   /*!< Blink disable  */
#define LCD_BLINKMODE_SEG0_COM0     (0x1UL << LCD_FCTRL_BLINK_Pos)  /*!< 0x00010000U Blink enabled on SEG[0], COM[0] (1 pixel)          */
#define LCD_BLINKMODE_SEG0_ALLCOM   (0x2UL << LCD_FCTRL_BLINK_Pos)  /*!< 0x00020000U Blink enabled on SEG[0], all COM (up to 8 pixels according to the programmed duty)          */
#define LCD_BLINKMODE_ALLSEG_ALLCOM (0x3UL << LCD_FCTRL_BLINK_Pos)  /*!< 0x00030000U Blink enabled on all SEG and all COM (all pixels)  */
/**
  * @}
  */

/**
 * @defgroup   LCD_Blink_Frequency
 */
#define LCD_BLINKFREQ_DIV_8     (0x00000000U)                       /*!< The Blink frequency = fck_div/8    */
#define LCD_BLINKFREQ_DIV_16    (0x1UL << LCD_FCTRL_BLINKF_Pos)     /*!< 0x00002000U The Blink frequency = fck_div/16   */
#define LCD_BLINKFREQ_DIV_32    (0x2UL << LCD_FCTRL_BLINKF_Pos)     /*!< 0x00004000U The Blink frequency = fck_div/32   */
#define LCD_BLINKFREQ_DIV_64    (0x3UL << LCD_FCTRL_BLINKF_Pos)     /*!< 0x00006000U The Blink frequency = fck_div/64   */
#define LCD_BLINKFREQ_DIV_128   (0x4UL << LCD_FCTRL_BLINKF_Pos)     /*!< 0x00008000U The Blink frequency = fck_div/128  */
#define LCD_BLINKFREQ_DIV_256   (0x5UL << LCD_FCTRL_BLINKF_Pos)     /*!< 0x0000A000U The Blink frequency = fck_div/256  */
#define LCD_BLINKFREQ_DIV_512   (0x6UL << LCD_FCTRL_BLINKF_Pos)     /*!< 0x0000C000U The Blink frequency = fck_div/512  */
#define LCD_BLINKFREQ_DIV_1024  (0x7UL << LCD_FCTRL_BLINKF_Pos)     /*!< 0x0000E000U The Blink frequency = fck_div/1024 */
/**
  * @}
  */

/**
 * @defgroup   LCD_MuxSegment
 */
#define LCD_MUXSEGMENT_DISABLE  (0x00000000U)       /*!< Mux segment disabled */
#define LCD_MUXSEGMENT_ENABLE   (LCD_CTRL_MUXSEG)   /*!< Mux segment enabled  */
/**
  * @}
  */

/**
 * @defgroup   LCD_Interrupt
 */
#define LCD_IT_UDD       (LCD_FCTRL_UDDIE)   /*!< Update display done interrupt */
#define LCD_IT_SOF       (LCD_FCTRL_SOFIE)   /*!< Start of frame interrupt */
/**
  * @}
  */

/**
 * @defgroup   LCD_Flag
 */
#define LCD_FLAG_ENSTS  (LCD_STS_ENSTS)     /*!< LCD enable flag*/
#define LCD_FLAG_SOF    (LCD_STS_SOF)       /*!< LCD start of frame event flag*/
#define LCD_FLAG_UDR    (LCD_STS_UDR)       /*!< Update display request Flag*/
#define LCD_FLAG_UDD    (LCD_STS_UDD)       /*!< Update display done event flag */
#define LCD_FLAG_RDY    (LCD_STS_RDY)       /*!< Ready flag */
#define LCD_FLAG_FCRSF  (LCD_STS_FCRSF)     /*!< LCD frame control register synchronization flag */
/**
  * @}
  */

/**
 * @defgroup   LCD_Flag_Clear
 */
#define LCD_FLAG_SOF_CLEAR  (LCD_CLR_SOFCLR)    /*!< Clear LCD start of frame event flag*/
#define LCD_FLAG_UDD_CLEAR  (LCD_CLR_UDDCLR)    /*!< Clear Update display done event flag */
/**
  * @}
  */


/* LCD Exported macros -----------------------------------------------------------*/
/** @defgroup LCD_Exported_Macros LCD Exported Macros
  * @{
  */

/** @brief Enable the LCD peripheral.
  * @param  None
  * @retval None
  */
#define __LCD_ENABLE()      SET_BIT(LCD->CTRL, LCD_CTRL_LCDEN)

/** @brief Disable the LCD peripheral.
  * @param  None
  * @retval None
  */
#define __LCD_DISABLE()      CLEAR_BIT(LCD->CTRL, LCD_CTRL_LCDEN)

/** @brief Enable the LCD voltage output buffer.
  * @param  None
  * @retval None
  */
#define __LCD_HIGHDRIVE_BUF_ENABLE()        SET_BIT(LCD->CTRL, LCD_CTRL_BUFEN)

/** @brief Disable the LCD voltage output buffer.
  * @param  None
  * @retval None
  */
#define __LCD_HIGHDRIVE_BUF_DISABLE()       CLEAR_BIT(LCD->CTRL, LCD_CTRL_BUFEN)

/** @brief Enable the LCD mux segment.
  * @param  None
  * @retval None
  */
#define __LCD_MUXSEG_ENABLE()               SET_BIT(LCD->CTRL, LCD_CTRL_MUXSEG)

/** @brief Disable the LCD mux segment.
  * @param  None
  * @retval None
  */
#define __LCD_MUXSEG_DISABLE()              CLEAR_BIT(LCD->CTRL, LCD_CTRL_MUXSEG)

